Tekla Open API Reference for Tekla Structures 2025
Angle Methods
The Angle type exposes the following members.
Methods
Name | Description
CompareTo
 Compares this angle with another angle
Equals
 Checks for approximate angle equality
FromCurrentUnit
 Creates an angle given in the current unit type
FromDegrees
 Creates an angle from a value in degrees
FromRadians
 Creates an angle from a value in radians
Parse(String)
 Parses the given text as an angle in the current unit type
Parse(String, IFormatProvider)
 Parses the given text as an angle in the current unit type
Parse(String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle in the current unit type
ToString()
 Converts the represented angle to a string in the current units
 (Overrides Object.ToString().)
ToString(Angle.UnitType)
 Converts the represented angle to a string in the given units
ToString(String, IFormatProvider)
 Converts the represented angle to a string with the given parameters
ToString(String, IFormatProvider, Angle.UnitType)
 Converts the represented angle to a string with the given parameters
TryParse(String, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle)
 Parses the given text as an angle in the current unit type
TryParse(String, IFormatProvider, Angle.UnitType, Angle)
 Parses the given text as an angle in the current unit type
Top
See Also
Reference
Angle Class
Tekla.Structures.Datatype Namespace